Revit 2027 API
Category.GetBuiltInCategoryTypeId Method
 Gets the ForgeTypeId identifying the given built-in category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId GetBuiltInCategoryTypeId(
	BuiltInCategory categoryId
)
Public Shared Function GetBuiltInCategoryTypeId (
	categoryId As BuiltInCategory
) As ForgeTypeId
public:
static ForgeTypeId^ GetBuiltInCategoryTypeId(
	BuiltInCategory categoryId
)
static member GetBuiltInCategoryTypeId :
        categoryId : BuiltInCategory -> ForgeTypeId
Parameters
categoryId BuiltInCategory
 The built-in category.
Return Value
ForgeTypeId
 The identifier of the given built-in category.
Exceptions
Exception | Condition
ArgumentException |  categoryId is not a valid built-in category. See Category.IsBuiltInCategoryValid(BuiltInCategory).
Remarks
 The given BuiltInCategory value must be valid according to Category.IsBuiltInCategoryValid(BuiltInCategory).
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace